# SQL - Basics

## Preparing Database / Tables / Data

In [ ]:
%load_ext sql

In [ ]:
%sql mysql+mysqldb://test_user:test_user@localhost/

In [ ]:
%%sql

SHOW DATABASES;

In [ ]:
%sql CREATE DATABASE IF NOT EXISTS SQL2MR

In [ ]:
# Using this DB
%sql mysql+mysqldb://test_user:test_user@localhost/SQL2MR

In [ ]:
%sql SHOW TABLES

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS person_1 (name varchar(20) not null, age int);
CREATE TABLE IF NOT EXISTS person_2 (name varchar(20) not null, age int);

In [ ]:
%sql SHOW TABLES

In [ ]:
%%sql
INSERT INTO person_1 (name, age)
VALUES
    ('Peter',25),
    ('Andrea',21),
    ('Urs',37);

INSERT INTO person_2 (name, age)
VALUES
    ('Monika',21),
    ('Andrea',23),
    ('Urs',37);

## The Data

In [ ]:
%sql SELECT * FROM person_1

In [ ]:
%sql SELECT * FROM person_2

## Selection
The `WHERE` clause in `sql`. For applying a condition over the data.

In [ ]:
%sql SELECT * FROM person_1 WHERE age > 22

## Projection
The `SELECT` clause in `sql`. For selecting columns.

In [ ]:
%sql SELECT name FROM person_1

## Union
The `UNION` / `UNION ALL` clause in `sql`.

In [ ]:
%sql SELECT * FROM person_1 UNION SELECT * FROM person_2

In [ ]:
%sql SELECT * FROM person_1 UNION ALL SELECT * FROM person_2

## INNER JOIN

In [ ]:
%%sql

SELECT
    p1.name as name, p1.age as p1_age, p2.age as p2_age
FROM
    person_1 AS p1
INNER JOIN person_2 AS p2
ON
    p1.name = p2.name

## LEFT JOIN

In [ ]:
%%sql

SELECT
    p1.name as name, p1.age as p1_age, p2.age as p2_age
FROM
    person_1 AS p1
LEFT JOIN person_2 AS p2
ON
    p1.name = p2.name

## RIGHT JOIN

In [ ]:
%%sql

SELECT
    p2.name as name, p1.age as p1_age, p2.age as p2_age
FROM
    person_1 AS p1
RIGHT JOIN person_2 AS p2
ON
    p1.name = p2.name

## GROUPING

In [ ]:
%%sql

SELECT name, count(age) as count, sum(age) as 'sum', min(age) as 'min', max(age) as 'max', avg(age) as 'avg' FROM (
    SELECT * 
    FROM 
        person_1
    UNION ALL 
    SELECT * 
    FROM 
        person_2) people
GROUP BY name, age

# Sorting

In [ ]:
%%sql

SELECT * FROM person_1
ORDER BY age DESC